Revit 2027 API
AlignmentStationLabelSetOptions.Interval Property
 The interval between labels to be created in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, a predefined interval value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 100 ft. For survey imperial, the default is 100 USft (US survey). For metric, the default is 1000 m.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? Interval { get; set; }
Public Property Interval As Double?
	Get
	Set
public:
property Nullable<double> Interval {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
member Interval : Nullable<float> with get, set
Property Value
Nullable<Double>
See Also
Reference
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace